# hi.py
# हिन्दी

encrypt1 = "कुंजी एन्क्रिप्ट कर रहा है..."

title1 = "हमारे भागीदारों को बहुत धन्यवाद!"

disclamer = "अस्वीकरण: सभी साइटों और प्रॉक्सी के काम करने की गारंटी नहीं है! \nउपयोग करके आप अपने कार्यों की पूरी जिम्मेदारी लेते हैं"

targetusernames = "लक्ष्य उपयोगकर्ता नाम: "

version = "संस्करण"

config1 = "कॉन्फ़िग फ़ाइल मौजूद है"
config2 = "अपडेट फ़ाइल मौजूद है"
config3 = "फ़ोल्डर पहले से मौजूद है: "
config4 = "अपडेट के लिए जाँच करें? [Y/n]: ⤷ "
config5 = "कॉन्फ़िग बदलें? [Y/n]: ⤷ "
config6 = "आप क्या बदलना चाहते हैं? ⤷ "
config7 = "फ़ोल्डर बना रहा है: "
config8 = "फ़ोल्डर पहले से मौजूद है: "

configOption1 = "[1] अपडेट के लिए जाँच करें: "
configOption2 = "[2] सुझाव दिखाएं: "
configOption3 = "[3] साइट डाउनलोड पथ: "
configOption4 = "[4] ब्राउज़र: "
configOption5 = "[5] भाषा: "
configOptionA = "[A] अल्फ्रेड को साफ़ करें। (यह अस्थायी फ़ाइलों को हटा देता है)"
configOptionB = "[B] डेवलपर टूल।"

configOption1Message = "ठीक! [checkforupdates] हाँ के लिए सेट है। नहीं में बदल रहा है"
configOption2Message = "ठीक! [showtips] हाँ के लिए सेट है। नहीं में बदल रहा है"
configOption3Message = "नया पथ: ⤷ "
configOption4Message = """समर्थित प्रकार:
                       Firefox
                       Edge
                       Chrome
                       """
configOption5Message = """कृपया अपनी भाषा कोड दर्ज करें
समर्थित भाषा:
    it = इतालवी
    en = अंग्रेज़ी
    il = हिब्रू
    es = स्पेनिश
    fr = फ़्रेंच
    ar = अरबी
    de = जर्मन
    ru = रूसी
    hi = हिंदी
                       """
configOptionAMessage = "पूरा हुआ!"
configOptionBMessage = "डेवलपर मेनू में आपका स्वागत है!"

configOption1Message2 = "ठीक है! [checkforupdates] नो के लिए सेट है। यस में बदल रहा है"
configOption2Message2 = "ठीक है! [showtips] नो के लिए सेट है। यस में बदल रहा है"
configOptionBMessage2 = "निम्नलिखित कुंजियों को किसी अल्फ्रेड डेवलपर को न दें।"
configOptionBMessage3 = "निजी कुंजी:"
configOptionBMessage4 = "syscrypt:"

target = "लक्ष्य: ⤷ "
browser = "ब्राउज़र: "

file_not_found = "फ़ाइल नहीं मिली: {filename}"
permission_denied = "{path} पर {operation} के लिए अनुमति अस्वीकृत"

note = "ध्यान दें! "
path = "रास्ता: ⤷ "
warning1 = "साइटें अपनी साइट फ़ाइलों को डाउनलोड करने की अनुमति नहीं दे सकती हैं। अपने जोखिम पर प्रयोग करें।"
warning2 = "वेबस्क्रैपर का उपयोग करना बहुत धीमा है।"
warning3 = "यह आपका पहला लॉन्च है :D सभी मॉड्यूल का उपयोग करने के लिए आपको अल्फ्रेड को पुनरारंभ करने की आवश्यकता हो सकती है"
warning4 = "आप अल्फ्रेड के एक प्रीरिलीज़ का उपयोग कर रहे हैं!"

confirm1 = "इमेज/वीडियो डाउनलोड करना चाहते हैं? [हां/नहीं] ⤷ "
confirm2 = "फिर से चलाएं?: [हां/नहीं] ⤷ "

prompt1 = "साइट फिर से दर्ज करें: ⤷ "
prompt2 = "कृपया हमारे रेपो या डिस्कॉर्ड सर्वर पर किसी भी बग या त्रुटि की रिपोर्ट करें।"
prompt3 = "आप कॉन्फ़िग फ़ाइल में अपडेटिंग को अक्षम कर सकते हैं"
prompt4 = "हमारे डिस्कॉर्ड में शामिल हों: https://discord.gg/xrdjxyuSQt"
prompt5 = "ठीक है! मैं बाद में पूछूंगा...."
prompt6 = "काम न करने वाली साइटें..."

download1 = "डाउनलोड हो रहा है "
updates = "अपडेट सक्षम हैं!"

idk1 = "निश्चित नहीं कि आपका क्या मतलब था...."
idk2 = "निश्चित नहीं कि आपका क्या मतलब था। मैं बाद में पूछूंगा"
idk3 = "निश्चित नहीं... लेकिन आप यहां जांच कर सकते हैं: "
scan1 = "के साथ साइटों की खोज कर रहा है: "

status1 = "काम कर रहा है...."
status2 = "सहेजें फ़ाइल बनाना/ओवरराइट करना।"
status3 = "पुनर्स्थापना............"
status4 = "जल्द ही अल्फ्रेड लौट रहा है..."
status5 = "परीक्षण....."
status6 = "रोक रहा है..... captured/working.txt में सहेजा गया"
status7 = "रोक रहा है........"

save1 = "परिणाम सहेजे गए"
save2 = "परिणाम फ़ाइल में सहेजे गए"
