# ru.py
# Русский

encrypt1 = "Шифрование ключа..."

title1 = "Большое спасибо нашим партнерам!"

disclamer = "     Отказ от ответственности: Не гарантируется работа всех сайтов и/или прокси! \n     Используя программу, вы полностью осознаете свои действия."

targetusernames = "Целевые имена пользователей: "

version = "Версия"

config1 = "Файл конфигурации существует"
config2 = "Файл обновления существует"
config3 = "Папка уже существует: "
config4 = "Проверить наличие обновлений? [Y/n]: ⤷ "
config5 = "Редактировать конфигурацию? [Y/n]: ⤷ "
config6 = "Что вы хотите изменить? ⤷ "
config7 = "Создание папки: "
config8 = "Папка уже существует: "

configOption1 = "[1] Проверять обновления: "
configOption2 = "[2] Показывать советы: "
configOption3 = "[3] Путь для загрузки сайтов: "
configOption4 = "[4] Браузер: "
configOption5 = "[5] Язык: "
configOptionA = "[A] Очистить Alfred. (Удаляет временные файлы)"
configOptionB = "[B] Инструменты разработчика."

configOption1Message = "OK! [checkforupdates] установлен на Да. Меняю на Нет"
configOption2Message = "OK! [showtips] установлен на Да. Меняю на Нет"
configOption3Message = "Новый путь: ⤷ "
configOption4Message = """Поддерживаемые типы:
                       Firefox
                       Edge
                       Chrome
                       """
configOption5Message = """
            Пожалуйста, введите код вашего языка
            Поддерживаемые языки:
                it = итальянский
                en = английский
                il = иврит
                es = испанский
                fr = французский
                ar = арабский
                de = немецкий
                ru = Русский
                hi = хинди
                       """
configOptionAMessage = "Готово!"
configOptionBMessage = "Добро пожаловать в меню разработчика!"

configOption1Message2 = "OK! [checkforupdates] установлен на Нет. Меняю на Да"
configOption2Message2 = "OK! [showtips] установлен на Нет. Меняю на Да"
configOptionBMessage2 = (
    "НЕ сообщайте следующие ключи никому, кроме разработчика Alfred."
)
configOptionBMessage3 = "privatekey: "
configOptionBMessage4 = "syscrypt: "

target = "Цель: ⤷ "
browser = "Браузер: "

file_not_found = "Файл не найден: {filename}"
permission_denied = "Отказано в разрешении на {operation} для {path}"

note = "Примечание! "
path = "ПУТЬ: ⤷ "
warning1 = "Сайты могут не разрешать скачивать файлы своего сайта. Используйте на свой страх и риск."
warning2 = " Использование веб-скрапинга довольно медленное."
warning3 = " Это ваш первый запуск :D Возможно, вам потребуется перезапустить Alfred, чтобы использовать все модули"
warning4 = " Вы используете предварительную версию Alfred!"

confirm1 = "Хотите загрузить изображения/видео? [Y/n] ⤷ "
confirm2 = "Запустить еще раз?: [Y/n] ⤷ "

prompt1 = "Введите сайт еще раз: ⤷ "
prompt2 = "Пожалуйста, сообщайте о любых ошибках или сбоях в наш репозиторий или на сервер Discord. "
prompt3 = "Вы можете отключить обновления в файле конфигурации"
prompt4 = "Присоединитесь к нашему Discord: https://discord.gg/xrdjxyuSQt "
prompt5 = "Хорошо! Спрошу позже..."
prompt6 = " Неработающие сайты..."

download1 = "Загрузка "
updates = "Обновления включены!"

idk1 = "Не уверен, что вы имели в виду..."
idk2 = "Не уверен, что вы имели в виду. Я спрошу позже"
idk3 = "Не уверен.... Но вы можете проверить здесь: "
scan1 = "поиск сайтов с: "

status1 = "Работаю...."
status2 = "Создание/перезапись файла сохранения"
status3 = "Переустановка............"
status4 = "Возвращение к Альфреду в ближайшее время..."
status5 = "Проверка....."
status6 = "Остановка..... Сохранено в captured/working.txt"
status7 = "Остановка........"

save1 = "Результаты сохранены в"
save2 = "Результаты сохранены в файл"

error1 = "Ошибка доступа"
error2 = "Ошибка типа"
error3 = "Не могу найти файл сохранения!"
error4 = "Директория не существует."
error5 = "Не могу найти необходимые файлы. Попытка переустановить Альфред"
error6 = "Ошибка! Похоже, соединение не работает. Проверьте соединение или прокси, затем повторите попытку:"
error7 = "Не могу найти файл сайта"
error8 = "Ошибка загрузки веб-контента!"
error9 = "Ошибка с файлом сайта"
error10 = "Неверный выбор драйвера веб-браузера."
error11 = "Произошла ошибка:"

fileshare1 = "[*] Прослушивание как"
fileshare2 = "подключен."
fileshare3 = "Получение"

wikiOption1 = "[1] Установка"
wikiOption2 = "[2] Параметры"
wikiOption3 = "[3] Ошибки"
wikiOption4 = "[4] Темный Альфред"
wikiOption5 = "[5] Модули"

wikilist = "Вы можете найти информацию об этом здесь:"

rqUname = "Запрошенное имя пользователя: "

sender1 = "[+] Подключение к"
sender2 = "[+] Подключено."
sender3 = "Отправка."
sender4 = "Файл для отправки: ⤷ "

fs1 = "Хост-сервер? [Y/N]: ⤷ "
fs2 = "Ожидание подключения к хосту!"
fs3 = "Ожидание подключения клиента!"

siteDl1 = "Всего файлов скриптов на странице:"
siteDl2 = "Всего CSS-файлов на странице:"
